# ==========================================
# import
# ==========================================

from routes import hankyu_kyoto


# ==========================================
# 阪急京都線 運用取得
# ==========================================

def get_hankyu_data(category):

    return hankyu_kyoto.get_hankyu_operations(
        category
    )


# ==========================================
# 実行
# ==========================================

def main():

    print("===================================")
    print("阪急京都線 運用情報取得開始")
    print("===================================")

    category = "平日特急"

    data = get_hankyu_data(category)

    print(data)


# ==========================================
# 起動
# ==========================================

if __name__ == "__main__":

    main()

